Учет_ФК/src/Documents/ПроведениеЛабораторныхИсследований/ПроведениеЛабораторныхИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеЛабораторныхИсследований</name>
  <registerRecords>InformationRegister.ДанныеСодержанияДМИПримесейВТранспортировочныхМестах</registerRecords>
  <registerRecords>InformationRegister.ДанныеЛабораторныхИсследований</registerRecords>
  <attributes>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛабораторнаяПроба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиСодержанияAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиСодержанияAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПрмесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПрмесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступленияПробы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеЛабораторныхИсследований/ДанныеЛабораторныхИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЛабораторныхИсследований</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СодержаниеAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛабораторнаяПроба</name>
    <type>
      <types>CatalogRef.ЛабораторныеПробы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/InformationRegisters/ДанныеСодержанияДМИПримесейВТранспортировочныхМестах/ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСодержанияДМИПримесейВТранспортировочныхМестах</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗатаркиТранспортировочныхМест</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницыТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортировочныеМеста</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоСухой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ПроведениеЛабораторныхИсследований/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДанныеЛабораторныхИсследований
	Движения.ДанныеЛабораторныхИсследований.Записывать = Истина;
	Движение = Движения.ДанныеЛабораторныхИсследований.Добавить();
	Движение.ЛабораторнаяПроба = ЛабораторнаяПроба;
	Движение.Партия = ПартияПродукции;
	Движение.СодержаниеAu = СодержаниеAu;
	Движение.ПоказательТочностиСодержанияAu = ПоказательТочностиСодержанияAu;
	Движение.СодержаниеAg = СодержаниеAg;
	Движение.ПоказательТочностиСодержанияAg = ПоказательТочностиСодержанияAg;
	Движение.ПримесиSобщ = ПримесиSобщ;
	Движение.ПоказательТочностиПримесиSобщ = ПоказательТочностиПримесиSобщ;
	Движение.ПримесиCорг = ПримесиCорг;
	Движение.ПоказательТочностиПримесиCорг = ПоказательТочностиПримесиCорг;
	Движение.ПримесиAs = ПримесиAs;
	Движение.ПоказательТочностиПрмесиAs = ПоказательТочностиПрмесиAs;
	Движение.ПримесиFe = ПримесиFe;
	Движение.ПоказательТочностиПрмесиFe = ПоказательТочностиПрмесиFe;

	//регистр Данные содержаний в транспортировочных местах
	
	Движения.ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукцииТранспортировочныеМеста.ТранспортировочноеМесто КАК ТранспортировочноеМесто,
		|	ВыпускПродукцииТранспортировочныеМеста.ВесНеттоСухой КАК ВесНеттоСухой
		|ИЗ
		|	Документ.ВыпускПродукции.ТранспортировочныеМеста КАК ВыпускПродукцииТранспортировочныеМеста
		|ГДЕ
		|	ВыпускПродукцииТранспортировочныеМеста.Ссылка.Проведен = ИСТИНА
		|	И ВыпускПродукцииТранспортировочныеМеста.Ссылка.Партия = &Партия";
	Запрос.УстановитьПараметр("Партия", ПартияПродукции);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.Добавить();
		Движение.ТранспортировочноеМесто = ВыборкаДетальныеЗаписи.ТранспортировочноеМесто;
		Движение.КоличествоAu 	= Окр(СодержаниеAu * ВыборкаДетальныеЗаписи.ВесНеттоСухой/1000,2,РежимОкругления.Окр15как20);
		Движение.КоличествоAg  	= Окр(СодержаниеAg * ВыборкаДетальныеЗаписи.ВесНеттоСухой/1000,2,РежимОкругления.Окр15как20);
		Движение.КоличествоAs   = Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой * ПримесиAs/100,3,РежимОкругления.Окр15как20);
		Движение.КоличествоCорг = Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой * ПримесиCорг/100,3,РежимОкругления.Окр15как20);
		Движение.КоличествоSобщ = Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой * ПримесиSобщ/100,3,РежимОкругления.Окр15как20);
		Движение.КоличествоFe   = Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой * ПримесиFe/100,3,РежимОкругления.Окр15как20);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
